Repository: rquesada/Norden
Catalog: NordenMobile/NordenMobile/Resouces/Localizable.xcstrings
Source language: en
Languages: es_419

source: By Mind Group
es_419: de Grupo Mind

source: Email
es_419: Correo electrónico

# forgot_password
source: Forgot your password?
es_419: ¿Olvidaste tu contraseña?

source: Loading...
es_419: Cargando…

source: Log in
es_419: Iniciar sesión

source: Logout
es_419: Terminar sesión

source: Password
es_419: Contraseña

# type_password
source: Type your password
es_419: Escribe tu contraseña

# use_mind_email
source: Use your Mind email
es_419: Usa tu correo de Mind

# welcome
source: Welcome to Mind’s Norden
es_419: Bienvenido a Norden de Mind

source: Welcome to Mind’s Norden
es_419: Bienvenidos a Norden

source: Welcome to NordenMobile!
es_419: Bienvenidos a Norden Mobile
